[
  {
    "id": 1,
    "courseCode": "ITCS333",
    "title": "Mobile Application Development",
    "description": "Mobile Application Development course covering cross-platform development using frameworks like React Native and Flutter. Includes UI design principles and API integration for mobile apps."
  },
  {
    "id": 2,
    "courseCode": "ITCS325",
    "title": "Data Structures and Algorithms",
    "description": "Data Structures and Algorithms course focusing on arrays, linked lists, trees, graphs, and algorithm complexity analysis. Practical implementation in Java and Python."
  },
  {
    "id": 3,
    "courseCode": "ITCS316",
    "title": "Database Systems",
    "description": "Database Systems fundamentals covering relational database design, SQL queries, normalization, and transaction management with hands-on MySQL projects."
  },
  {
    "id": 4,
    "courseCode": "ITCS389",
    "title": "Software Engineering",
    "description": "Software Engineering principles including Agile methodologies, UML diagrams, design patterns, and software testing techniques for full project lifecycle development."
  },
  {
    "id": 5,
    "courseCode": "ITCS347",
    "title": "Operating Systems",
    "description": "Operating Systems concepts including process management, memory allocation, file systems, and virtualization with practical exercises in Linux environment."
  },
  {
    "id": 6,
    "courseCode": "ITCS214",
    "title": "Computer Networks",
    "description": "Computer Networks fundamentals covering TCP/IP stack, routing protocols, network security, and socket programming with Wireshark lab exercises."
  },
  {
    "id": 7,
    "courseCode": "ITCS114",
    "title": "Introduction to Programming",
    "description": "Introduction to Programming using Python covering basic syntax, control structures, functions, and object-oriented programming concepts for beginners."
  },
  {
    "id": 8,
    "courseCode": "ITCS113",
    "title": "Discrete Mathematics",
    "description": "Discrete Mathematics for Computer Science including logic, sets, relations, combinatorics, and graph theory with applications to computing problems."
  },
  {
    "id": 9,
    "courseCode": "ITCS453",
    "title": "Web Development",
    "description": "Web Development fundamentals covering HTML5, CSS3, JavaScript, and responsive design principles with Bootstrap framework implementation."
  },
  {
    "id": 10,
    "courseCode": "ITCS498",
    "title": "Senior Capstone Project",
    "description": "Senior Capstone Project where student teams design, develop and present complete software solutions addressing real-world business problems."
  },
  {
    "id": 11,
    "courseCode": "ITCS444",
    "title": "Artificial Intelligence",
    "description": "Artificial Intelligence fundamentals including search algorithms, machine learning basics, neural networks, and natural language processing concepts."
  },
  {
    "id": 12,
    "courseCode": "ITCS389",
    "title": "Cybersecurity Essentials",
    "description": "Cybersecurity Essentials covering encryption methods, authentication protocols, ethical hacking principles, and security best practices for system protection."
  }
]
